{
  "us": {
    "greyhound": {
      "display_name": "M8 Greyhound",
      "short_description": "",
      "emoji": "🛡️",
      "title": "🇺🇸 M8 Greyhound Recon Tank",
      "color": "0x5865F2",
      "thumbnail": "M8_Greyhound.png",
      "additional_images": [
        "m8-greyhound-3.png",
        "danny-art-recon-hll-da-02.jpg",
        "table_recon.png"
      ],
      "field_nation": "United States",
      "field_class": "Light Recon Tank",
      "field_crew": "3 (Commander/Gunner, Loader, Driver)",
      "field_top_speed": "~30 km/h",
      "field_main_armament": "37mm M6 Gun (AP & HE shells)",
      "field_secondary_armament": ".50 cal Roof MG",
      "field_armor": "Very Light (easily penetrated from all angles, even by small arms splash)",
      "field_🧠_tactical_overview": "The Greyhound is a recon vehicle disguised as a light tank. Fast, nimble, and deadly in the right hands, it’s best used for flanking, hunting soft targets, and scouting high-risk zones. While it lacks armor, its .50 cal machine gun is brutal against infantry and light vehicles. It plays a similar role to the Stuart, but with slightly more versatility and anti-infantry punch.",
      "field_🔥_best_use_cases": "Deep Flanks & Ambushes: Bypass enemy lines and hit supply trucks, OPs, and garrisons where they least expect.\nAT Gun Hunter: Greyhounds are fantastic at clearing out static AT gun crews before they can fire.\nInfantry Shredder: That roof-mounted .50 cal devastates infantry on the move or in trenches.\nDecoy & Distraction: Draw enemy tanks or AT fire while your team maneuvers for a kill.",
      "field_💡_tips_for_success": "Always be moving—your speed and unpredictability are your best armor.\nAim for the sides or rear of enemy armor only—your 37mm cannot pen most fronts.\nUse your .50 cal to mow down infantry squads trying to cross open ground.\nPop smoke and disengage if you're spotted; you can escape almost any situation if you react fast.",
      "field_⚠️_known_weaknesses": "Glass cannon—everything kills you fast, even small arms from above if your top is exposed.\nNo coaxial MG—infantry suppression depends solely on the .50 cal, which is vulnerable when hull down.\n37mm gun is ineffective vs mediums and useless vs heavies.\nLoud engine and recognizable silhouette make stealth tricky if you stay in one place too long.",
      "field_✅_summary": "The M8 Greyhound is a speed demon and one of the most versatile recon tools in the American tank lineup. While not suited for slugging matches, it excels in guerrilla-style tanking—harass, kill, vanish, repeat. Ideal for confident crews who thrive on mobility, map awareness, and taking bold risks behind enemy lines."
    },
    "stuart": {
      "display_name": "M5A1 Stuart",
      "short_description": "",
      "emoji": "🛡️",
      "title": "🇺🇸 M5A1 Stuart Light Tank",
      "color": "0x5865F2",
      "thumbnail": "M5A1_Stuart.png",
      "additional_images": [],
      "field_nation": "United States",
      "field_class": "Light Tank",
      "field_crew": "3 (Commander, Gunner, Driver)",
      "field_top_speed": "~30 km/h",
      "field_main_armament": "37mm M6 Gun (AP & HE shells)",
      "field_secondary_armament": "Coaxial .30 cal MG + Hull .30 cal MG",
      "field_armor": "Light (vulnerable to AT rifles, rockets, and even small arms splash)",
      "field_🧠_tactical_overview": "The Stuart is the lightest and most agile American tank in Hell Let Loose. Designed for speed, scouting, and infantry suppression, it thrives on mobility. While its small cannon is ineffective against anything but light armor, the Stuart is a menace to infantry and perfect for early-game disruption or recon.",
      "field_🔥_best_use_cases": "Scouting Ahead: Use your speed to locate enemy armor and outposts early in the match.\nInfantry Harassment: Dual MGs let you shred infantry clusters, especially around objectives or open fields.\nRear Flanking: Catch distracted enemy tanks and disable engines with surgical rear shots.\nBait & Evade: Lure out AT squads or draw fire while friendlies reposition for the kill.",
      "field_💡_tips_for_success": "Circle slower tanks like the Panzer IV or Puma and aim for rear or engine shots—don’t stop moving.\nUse smoke to cover retreats or mask your location during flanking maneuvers.\nDon't hesitate to go deep behind lines if you see a weak flank—your speed can get you in and out.\nCoordinate with AT guns or mediums: mark targets and act as the team’s mobile eyes.",
      "field_⚠️_known_weaknesses": "Extremely low survivability—nearly anything can kill you, even lucky infantry grenades.\n37mm cannon is ineffective vs mediums or heavies—don’t go toe-to-toe.\nRear engine makes it easy to disable or destroy when flanked.\nPoor turret armor—can be penned easily from almost any angle.",
      "field_✅_summary": "The M5A1 Stuart isn’t a frontline brawler—it’s a roving scout, infantry sweeper, and flanker. Think of it as a battlefield mosquito: fast, annoying, and hard to pin down. With skilled use of mobility, terrain, and smart engagements, it can punch well above its weight and be a serious early-game asset to your team."
    },
    "sherman": {
      "display_name": "M4A1 Sherman",
      "short_description": "",
      "emoji": "🛡️",
      "title": "🇺🇸 M4A1 Sherman Medium Tank",
      "color": "0x5865F2",
      "thumbnail": "M4A1_Sherman.png",
      "additional_images": [],
      "field_nation": "United States",
      "field_class": "Medium Tank",
      "field_crew": "3 (Commander/Gunner, Loader, Driver)",
      "field_top_speed": "~30 km/h",
      "field_main_armament": "75mm M3 Gun (AP & HE shells)",
      "field_secondary_armament": "Coaxial .30 cal MG + Hull .30 cal MG",
      "field_armor": "Medium (sloped front hull offers limited protection against other mediums)",
      "field_🧠_tactical_overview": "The Sherman Medium is the classic workhorse of the American armored division. It has balanced mobility, respectable firepower, and decent survivability in early- and mid-game fights. While it doesn’t shine against heavies, it can comfortably engage German Panzer IVs and light tanks while offering excellent infantry support.",
      "field_🔥_best_use_cases": "Infantry Fire Support: Excellent HE round performance and two machine guns make this a trench-clearing beast.\nDuels with German Mediums: You can go toe-to-toe with Panzer IVs when played smart.\nLine Holding: A reliable tank to anchor a push or defend a strongpoint with infantry support.\nMobile Coverage: Fast enough to react to threats or reposition between objectives.",
      "field_💡_tips_for_success": "Focus fire on German medium tanks, not heavies—you’ll lose against Panthers or Tigers.\nUse your sloped armor—keep frontal angles toward the enemy to increase bounce chance.\nHull-down positioning (only exposing your turret) can protect your weaker hull from AT fire.\nPop smoke and reposition often. Staying still too long invites enemy tank or AT gunners.",
      "field_⚠️_known_weaknesses": "Vulnerable turret mantle—Panzer IVs can pen this area with ease if not obscured.\nWeak vs heavies—Tigers and Panthers outgun and out-armor you completely.\nLower shell velocity makes long-range tank engagements tricky.\nWide side profile makes you an easy AT rocket target when exposed.",
      "field_✅_summary": "The M4A1 Sherman is a dependable all-rounder that shines in the early game and infantry-heavy fights. It's not flashy, but it can hold its own in most matchups with smart positioning and crew coordination. Pair it with infantry, use your speed to pick your battles, and avoid fighting up-gunned Panthers or Tigers head-on."
    },
    "jumbo_75": {
      "display_name": "M4A3 75mm",
      "short_description": "",
      "emoji": "🛡️",
      "title": "🇺🇸 M4A3 75mm “Jumbo” Heavy Tank",
      "color": "0x5865F2",
      "thumbnail": "M4A3E2_75mm.png",
      "additional_images": [],
      "field_nation": "United States",
      "field_class": "Heavy Tank",
      "field_crew": "3 (Commander/Gunner, Loader, Driver)",
      "field_top_speed": "~18 km/h",
      "field_main_armament": "75mm M3 Gun (AP & HE shells)",
      "field_secondary_armament": "Coaxial .30 cal MG + Hull .30 cal MG",
      "field_armor": "Heavy (exceptionally thick frontal armor; extremely difficult to penetrate from the front)",
      "field_🧠_tactical_overview": "The “Jumbo” 75mm is a beastly tank when it comes to soaking damage and holding the line. Its thick frontal armor is nearly impervious to everything except Panthers and Tigers, and even then it can bounce shots if angled correctly. However, its 75mm gun is underwhelming in anti-tank combat, relegating this tank to a defensive support role.",
      "field_🔥_best_use_cases": "Frontline Anchor: Sit on a strongpoint and absorb enemy fire while infantry pushes in.\nAnti-Infantry Fortress: Devastating against infantry and emplacements with its HE shells and dual MGs.\nBait Tank: Draw fire from German heavies while your 76mm Jumbo or AT guns move in for the kill.\nZone Denial: Its intimidating presence alone can prevent German armor from advancing.",
      "field_💡_tips_for_success": "Face your front toward threats—your hull can bounce most German shots, even from Panthers.\nAvoid extended duels with Tigers or Panthers—your gun can’t kill them easily.\nUse terrain to protect your weaker sides and rear—those are your Achilles’ heel.\nPair with infantry or a 76mm Jumbo—your armor + their firepower = deadly combo.",
      "field_⚠️_known_weaknesses": "Poor speed and maneuverability—you're slow to rotate or reposition.\nWeak gun against enemy tanks—your AP rounds struggle vs German heavies.\nMassive target—easy for AT players to mark and rocket, especially from the sides.\nVulnerable to engine damage if flanked or caught from the rear.",
      "field_✅_summary": "The M4A3 75mm “Jumbo” is a slow, heavily armored infantry support tank. You won't be flanking Tigers or dueling Panthers successfully, but if your team needs a tank to hold a cap under fire, there is none better. Park it on the objective, aim your gun at infantry threats, and soak up punishment like a champion."
    },
    "jumbo_76": {
      "display_name": "M4A3 76mm",
      "short_description": "",
      "emoji": "🛡️",
      "title": "🇺🇸 M4A3 76mm “Jumbo” Heavy Tank",
      "color": "0x5865F2",
      "thumbnail": "M4A3E2_76mm.png",
      "additional_images": [],
      "field_nation": "United States",
      "field_class": "Heavy Tank",
      "field_crew": "3 (Commander/Gunner, Loader, Driver)",
      "field_top_speed": "~18 km/h",
      "field_main_armament": "76mm M1A1 Gun (AP & HE shells)",
      "field_secondary_armament": "Coaxial .30 cal MG + Hull .30 cal MG",
      "field_armor": "Heavy (frontal plate can bounce nearly anything; sides and rear remain vulnerable)",
      "field_🧠_tactical_overview": "The 76mm Jumbo is the heaviest-hitting tank in the American arsenal. It combines the near-impenetrable armor of the 75mm Jumbo with a powerful 76mm cannon that gives it a fighting chance against Panthers and Tigers. It’s slower than mediums, but when deployed correctly, it’s a battlefield juggernaut capable of taking on Germany’s finest.",
      "field_🔥_best_use_cases": "Heavy Tank Duelist: Best suited for engaging Panthers and Tigers when well positioned.\nStrongpoint Defender: Park it on the objective and rain hell on enemy infantry and armor.\nCounter-Armor Response: Acts as the US’s primary answer to enemy heavies when mediums can't compete.\nSupport Spearhead: Moves with infantry to break enemy defenses with AP and HE firepower.",
      "field_💡_tips_for_success": "Always angle your armor—your sides are vulnerable, but your front is nearly invincible.\nUse your cannon's penetration to target side plates or weak spots on Panthers and Tigers.\nLand the first shot! In even duels, the one who shoots first often wins.\nAvoid going solo—infantry support will keep AT off your flanks.",
      "field_⚠️_known_weaknesses": "Sluggish speed and turn rate—easy to flank or trap if caught alone.\nLong reload time—get punished hard for missing shots.\nCupola and rounded turret areas can deflect incoming shots poorly or be penned if exposed.\nMassive profile and slow repositioning make you a priority target for enemy recon and AT teams.",
      "field_✅_summary": "The M4A3 76mm “Jumbo” is the best the US can field in Hell Let Loose when it comes to tank-on-tank fights. It’s slower and less versatile than mediums, but its thick armor and hard-hitting gun give you the tools to shut down Germany’s armor pushes—if you know how to use it. Position smart, keep your front toward the enemy, and don't miss your shot."
    }
  }
}